Revit 2027 API
FamilyElementVisibilityType Enumeration
Indicates the Visibility type of generic forms.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FamilyElementVisibilityType
Public Enumeration FamilyElementVisibilityType
public enum class FamilyElementVisibilityType
type FamilyElementVisibilityType
Members
Member name | Value | Description
Model | 0 | The element will be displayed in 3D views and model other model views.
ViewSpecific | 1 | The element will be displayed only in the view where it is created. This applies to items like detail components, annotations, and view-specific imports.
Remarks
Use this enum to indicate the visibility type of new forms.
See Also
Reference
Autodesk.Revit.DB Namespace